/** Лабораторная работа 32.*/

/// Герасимов Д.А., П1-18

#include <iostream>

#include "func.h"

using namespace std;

void menu(){
	cout << endl 
		<< "----------------------------------------------------------" << endl
		<< "\tMenu" << endl
		<< "0. Выйти" << endl
		<< "1. Загрузить файл в память" << endl
		<< "2. Добавить запись из файла в массив (вектор)" << endl
		<< "3. Заменить строку с номером N" << endl
		<< "4. Удалить строку с номером N" << endl
		<< "5. Выгрузить строки из памяти в файл" << endl
		<< "6. Отпечатать суммарные ежемесячные и годовую продажи" << endl
		<< "----------------------------------------------------------" << endl
			<< endl;
}

int main(){
	

	return 0;
}
